Revit 2027 API
DirectShapeType.IsValidShape(IList<GeometryObject>) Method
 Validates shape to be stored in a DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidShape(
	IList<GeometryObject> shape
)
Public Function IsValidShape (
	shape As IList(Of GeometryObject)
) As Boolean
public:
bool IsValidShape(
	IList<GeometryObject^>^ shape
)
member IsValidShape :
        shape : IList<GeometryObject> -> bool
Parameters
shape IList<GeometryObject>
 Shape to be validated represented as a collection of GeometryObjects. The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.
Return Value
Boolean
 True if the supplied shape passes the validation criteria.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This function calls IsValidShape(GeometryObject) to validate each object in the list.
See Also
Reference
DirectShapeType Class
IsValidShape Overload
Autodesk.Revit.DB Namespace